{"backend": "tensorflow", "config": {"name": "model_2", "output_layers": [["sigmoid", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "Input", "config": {"name": "Input", "sparse": false, "batch_input_shape": [null, 236, 348, 3], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "InputLayer", "name": "InputLog", "config": {"name": "InputLog", "sparse": false, "batch_input_shape": [null, 236, 348, 3], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv0", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [3, 3], "padding": "valid", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [5, 5], "data_format": "channels_last", "kernel_constraint": null, "filters": 32, "bias_constraint": null, "name": "conv0", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_log0", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [3, 3], "padding": "valid", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [5, 5], "data_format": "channels_last", "kernel_constraint": null, "filters": 32, "bias_constraint": null, "name": "conv_log0", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["InputLog", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn0", "config": {"trainable": true, "beta_regularizer": null, "gamma_constraint": null, "scale": true, "axis": 3, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn0", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "center": true}, "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn_log0", "config": {"trainable": true, "beta_regularizer": null, "gamma_constraint": null, "scale": true, "axis": 3, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_log0", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "center": true}, "inbound_nodes": [[["conv_log0", 0, 0, {}]]]}, {"class_name": "Activation", "name": "a0", "config": {"name": "a0", "trainable": true, "activation": "elu"}, "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"class_name": "Activation", "name": "a_log0", "config": {"name": "a_log0", "trainable": true, "activation": "elu"}, "inbound_nodes": [[["bn_log0", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pool0", "config": {"pool_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "valid", "name": "max_pool0", "trainable": true}, "inbound_nodes": [[["a0", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pool_log0", "config": {"pool_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "valid", "name": "max_pool_log0", "trainable": true}, "inbound_nodes": [[["a_log0", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_19", "config": {"seed": null, "name": "dropout_19", "rate": 0.1, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["max_pool0", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_20", "config": {"seed": null, "name": "dropout_20", "rate": 0.1, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["max_pool_log0", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv1", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [2, 2], "padding": "valid", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [7, 7], "data_format": "channels_last", "kernel_constraint": null, "filters": 64, "bias_constraint": null, "name": "conv1", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_log1", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [2, 2], "padding": "valid", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [7, 7], "data_format": "channels_last", "kernel_constraint": null, "filters": 64, "bias_constraint": null, "name": "conv_log1", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn1", "config": {"trainable": true, "beta_regularizer": null, "gamma_constraint": null, "scale": true, "axis": 3, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "center": true}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn_log1", "config": {"trainable": true, "beta_regularizer": null, "gamma_constraint": null, "scale": true, "axis": 3, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_log1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "center": true}, "inbound_nodes": [[["conv_log1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "a1", "config": {"name": "a1", "trainable": true, "activation": "elu"}, "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "a_log1", "config": {"name": "a_log1", "trainable": true, "activation": "elu"}, "inbound_nodes": [[["bn_log1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pool1", "config": {"pool_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "valid", "name": "max_pool1", "trainable": true}, "inbound_nodes": [[["a1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pool_log1", "config": {"pool_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "valid", "name": "max_pool_log1", "trainable": true}, "inbound_nodes": [[["a_log1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_21", "config": {"seed": null, "name": "dropout_21", "rate": 0.1, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["max_pool1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_22", "config": {"seed": null, "name": "dropout_22", "rate": 0.1, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["max_pool_log1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [3, 3], "padding": "valid", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [9, 9], "data_format": "channels_last", "kernel_constraint": null, "filters": 128, "bias_constraint": null, "name": "conv2", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_log2", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [3, 3], "padding": "valid", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [9, 9], "data_format": "channels_last", "kernel_constraint": null, "filters": 128, "bias_constraint": null, "name": "conv_log2", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2", "config": {"trainable": true, "beta_regularizer": null, "gamma_constraint": null, "scale": true, "axis": 3, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "center": true}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn_log2", "config": {"trainable": true, "beta_regularizer": null, "gamma_constraint": null, "scale": true, "axis": 3, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_log2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "center": true}, "inbound_nodes": [[["conv_log2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "a2", "config": {"name": "a2", "trainable": true, "activation": "elu"}, "inbound_nodes": [[["bn2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "a_log2", "config": {"name": "a_log2", "trainable": true, "activation": "elu"}, "inbound_nodes": [[["bn_log2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pool2", "config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "max_pool2", "trainable": true}, "inbound_nodes": [[["a2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pool_log2", "config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "max_pool_log2", "trainable": true}, "inbound_nodes": [[["a_log2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_23", "config": {"seed": null, "name": "dropout_23", "rate": 0.2, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["max_pool2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_24", "config": {"seed": null, "name": "dropout_24", "rate": 0.2, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["max_pool_log2", 0, 0, {}]]]}, {"class_name": "InputLayer", "name": "In_params", "config": {"name": "In_params", "sparse": false, "batch_input_shape": [null, 38], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "InputLayer", "name": "Out_params", "config": {"name": "Out_params", "sparse": false, "batch_input_shape": [null, 20], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Flatten", "name": "flatten_5", "config": {"name": "flatten_5", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["dropout_23", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_6", "config": {"name": "flatten_6", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["dropout_24", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_8", "config": {"name": "concatenate_8", "axis": -1, "trainable": true}, "inbound_nodes": [[["In_params", 0, 0, {}], ["Out_params", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_7", "config": {"name": "concatenate_7", "axis": -1, "trainable": true}, "inbound_nodes": [[["flatten_5", 0, 0, {}], ["flatten_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn_params", "config": {"trainable": true, "beta_regularizer": null, "gamma_constraint": null, "scale": true, "axis": -1, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_params", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "center": true}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_9", "config": {"name": "concatenate_9", "axis": -1, "trainable": true}, "inbound_nodes": [[["concatenate_7", 0, 0, {}], ["bn_params", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc0", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "units": 100, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "name": "fc0", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_25", "config": {"seed": null, "name": "dropout_25", "rate": 0.2, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["fc0", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc1", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "units": 80, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "name": "fc1", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_25", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_26", "config": {"seed": null, "name": "dropout_26", "rate": 0.2, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc2", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "units": 60, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "name": "fc2", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_26", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_27", "config": {"seed": null, "name": "dropout_27", "rate": 0.2, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["fc2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc3", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "units": 40, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "name": "fc3", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_27", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_28", "config": {"seed": null, "name": "dropout_28", "rate": 0.2, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["fc3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc4", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "units": 20, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "name": "fc4", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_28", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_29", "config": {"seed": null, "name": "dropout_29", "rate": 0.2, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["fc4", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc5", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "units": 10, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "name": "fc5", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_29", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_30", "config": {"seed": null, "name": "dropout_30", "rate": 0.2, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["fc5", 0, 0, {}]]]}, {"class_name": "Dense", "name": "sigmoid", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "sigmoid", "units": 1, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "name": "sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_30", 0, 0, {}]]]}], "input_layers": [["Input", 0, 0], ["InputLog", 0, 0], ["In_params", 0, 0], ["Out_params", 0, 0]]}, "keras_version": "2.2.4", "class_name": "Model"}