{"keras_version": "2.2.3", "config": {"name": "model_7", "input_layers": [["Input", 0, 0]], "output_layers": [["sigmoid", 0, 0]], "layers": [{"name": "Input", "config": {"sparse": false, "dtype": "float32", "name": "Input", "batch_input_shape": [null, 236, 348, 3]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv0", "config": {"name": "conv0", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "filters": 32, "strides": [4, 4], "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_size": [7, 7]}, "inbound_nodes": [[["Input", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "bn0", "config": {"beta_constraint": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn0", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "gamma_constraint": null, "center": true, "axis": 3}, "inbound_nodes": [[["conv0", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "a0", "config": {"name": "a0", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn0", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pool0", "config": {"name": "max_pool0", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true}, "inbound_nodes": [[["a0", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_41", "config": {"name": "dropout_41", "trainable": true, "rate": 0.4, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pool0", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv1", "config": {"name": "conv1", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "filters": 128, "strides": [3, 3], "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_size": [5, 5]}, "inbound_nodes": [[["dropout_41", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "bn1", "config": {"beta_constraint": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "gamma_constraint": null, "center": true, "axis": 3}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "a1", "config": {"name": "a1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pool1", "config": {"name": "max_pool1", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true}, "inbound_nodes": [[["a1", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_42", "config": {"name": "dropout_42", "trainable": true, "rate": 0.4, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pool1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2", "config": {"name": "conv2", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "filters": 256, "strides": [1, 1], "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_42", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "bn2", "config": {"beta_constraint": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "gamma_constraint": null, "center": true, "axis": 3}, "inbound_nodes": [[["conv2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "a2", "config": {"name": "a2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pool2", "config": {"name": "max_pool2", "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "pool_size": [1, 1], "trainable": true}, "inbound_nodes": [[["a2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_43", "config": {"name": "dropout_43", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pool2", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "flatten_7", "config": {"name": "flatten_7", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_43", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "fc0", "config": {"bias_constraint": null, "units": 20, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "fc0", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "relu"}, "inbound_nodes": [[["flatten_7", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_44", "config": {"name": "dropout_44", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["fc0", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "fc1", "config": {"bias_constraint": null, "units": 10, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "fc1", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "relu"}, "inbound_nodes": [[["dropout_44", 0, 0, {}]]], "class_name": "Dense"}, {"name": "sigmoid", "config": {"bias_constraint": null, "units": 1, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "sigmoid"}, "inbound_nodes": [[["fc1", 0, 0, {}]]], "class_name": "Dense"}]}, "class_name": "Model", "backend": "tensorflow"}