{"keras_version": "2.2.3", "backend": "tensorflow", "config": {"name": "model_7", "input_layers": [["Input", 0, 0]], "layers": [{"name": "Input", "inbound_nodes": [], "config": {"sparse": false, "name": "Input", "dtype": "float32", "batch_input_shape": [null, 236, 348, 3]}, "class_name": "InputLayer"}, {"name": "conv0", "inbound_nodes": [[["Input", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 32, "strides": [4, 4], "kernel_size": [7, 7], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv0", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "bn0", "inbound_nodes": [[["conv0", 0, 0, {}]]], "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "trainable": true, "name": "bn0", "scale": true, "beta_regularizer": null, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "a0", "inbound_nodes": [[["bn0", 0, 0, {}]]], "config": {"name": "a0", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "max_pool0", "inbound_nodes": [[["a0", 0, 0, {}]]], "config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pool0", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "dropout_41", "inbound_nodes": [[["max_pool0", 0, 0, {}]]], "config": {"noise_shape": null, "name": "dropout_41", "trainable": true, "rate": 0.4, "seed": null}, "class_name": "Dropout"}, {"name": "conv1", "inbound_nodes": [[["dropout_41", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 128, "strides": [3, 3], "kernel_size": [5, 5], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv1", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "bn1", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "trainable": true, "name": "bn1", "scale": true, "beta_regularizer": null, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "a1", "inbound_nodes": [[["bn1", 0, 0, {}]]], "config": {"name": "a1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "max_pool1", "inbound_nodes": [[["a1", 0, 0, {}]]], "config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pool1", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "dropout_42", "inbound_nodes": [[["max_pool1", 0, 0, {}]]], "config": {"noise_shape": null, "name": "dropout_42", "trainable": true, "rate": 0.4, "seed": null}, "class_name": "Dropout"}, {"name": "conv2", "inbound_nodes": [[["dropout_42", 0, 0, {}]]], "config": {"bias_constraint": null, "filters": 256, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"name": "bn2", "inbound_nodes": [[["conv2", 0, 0, {}]]], "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "trainable": true, "name": "bn2", "scale": true, "beta_regularizer": null, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "a2", "inbound_nodes": [[["bn2", 0, 0, {}]]], "config": {"name": "a2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"name": "max_pool2", "inbound_nodes": [[["a2", 0, 0, {}]]], "config": {"strides": [1, 1], "padding": "valid", "pool_size": [1, 1], "name": "max_pool2", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "dropout_43", "inbound_nodes": [[["max_pool2", 0, 0, {}]]], "config": {"noise_shape": null, "name": "dropout_43", "trainable": true, "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"name": "flatten_7", "inbound_nodes": [[["dropout_43", 0, 0, {}]]], "config": {"name": "flatten_7", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"name": "fc0", "inbound_nodes": [[["flatten_7", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "fc0", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 20, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}, "class_name": "Dense"}, {"name": "dropout_44", "inbound_nodes": [[["fc0", 0, 0, {}]]], "config": {"noise_shape": null, "name": "dropout_44", "trainable": true, "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"name": "fc1", "inbound_nodes": [[["dropout_44", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "fc1", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 10, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}, "class_name": "Dense"}, {"name": "sigmoid", "inbound_nodes": [[["fc1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "sigmoid", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 1, "activity_regularizer": null, "bias_regularizer": null, "activation": "sigmoid", "bias_constraint": null}, "class_name": "Dense"}], "output_layers": [["sigmoid", 0, 0]]}, "class_name": "Model"}