{"config": {"input_layers": [["Input", 0, 0], ["InputLog", 0, 0], ["In_params", 0, 0], ["Out_params", 0, 0]], "name": "model_1", "layers": [{"config": {"batch_input_shape": [null, 236, 348, 3], "dtype": "float32", "name": "Input", "sparse": false}, "name": "Input", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"batch_input_shape": [null, 236, 348, 3], "dtype": "float32", "name": "InputLog", "sparse": false}, "name": "InputLog", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"activity_regularizer": null, "trainable": true, "padding": "valid", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [5, 5], "bias_regularizer": null, "name": "conv0", "strides": [3, 3], "filters": 32, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv0", "class_name": "Conv2D", "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "trainable": true, "padding": "valid", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [5, 5], "bias_regularizer": null, "name": "conv_log0", "strides": [3, 3], "filters": 32, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_log0", "class_name": "Conv2D", "inbound_nodes": [[["InputLog", 0, 0, {}]]]}, {"config": {"center": true, "trainable": true, "momentum": 0.99, "name": "bn0", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "bn0", "class_name": "BatchNormalization", "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"config": {"center": true, "trainable": true, "momentum": 0.99, "name": "bn_log0", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "bn_log0", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_log0", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "a0", "activation": "elu"}, "name": "a0", "class_name": "Activation", "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "a_log0", "activation": "elu"}, "name": "a_log0", "class_name": "Activation", "inbound_nodes": [[["bn_log0", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pool0", "pool_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last"}, "name": "max_pool0", "class_name": "MaxPooling2D", "inbound_nodes": [[["a0", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pool_log0", "pool_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last"}, "name": "max_pool_log0", "class_name": "MaxPooling2D", "inbound_nodes": [[["a_log0", 0, 0, {}]]]}, {"config": {"noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_1", "seed": null}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["max_pool0", 0, 0, {}]]]}, {"config": {"noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_2", "seed": null}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["max_pool_log0", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "trainable": true, "padding": "valid", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [7, 7], "bias_regularizer": null, "name": "conv1", "strides": [2, 2], "filters": 64, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv1", "class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "trainable": true, "padding": "valid", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [7, 7], "bias_regularizer": null, "name": "conv_log1", "strides": [2, 2], "filters": 64, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_log1", "class_name": "Conv2D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"center": true, "trainable": true, "momentum": 0.99, "name": "bn1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"config": {"center": true, "trainable": true, "momentum": 0.99, "name": "bn_log1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "bn_log1", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_log1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "a1", "activation": "elu"}, "name": "a1", "class_name": "Activation", "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "a_log1", "activation": "elu"}, "name": "a_log1", "class_name": "Activation", "inbound_nodes": [[["bn_log1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pool1", "pool_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last"}, "name": "max_pool1", "class_name": "MaxPooling2D", "inbound_nodes": [[["a1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pool_log1", "pool_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last"}, "name": "max_pool_log1", "class_name": "MaxPooling2D", "inbound_nodes": [[["a_log1", 0, 0, {}]]]}, {"config": {"noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_3", "seed": null}, "name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["max_pool1", 0, 0, {}]]]}, {"config": {"noise_shape": null, "rate": 0.1, "trainable": true, "name": "dropout_4", "seed": null}, "name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["max_pool_log1", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "trainable": true, "padding": "valid", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [9, 9], "bias_regularizer": null, "name": "conv2", "strides": [3, 3], "filters": 128, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2", "class_name": "Conv2D", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "trainable": true, "padding": "valid", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [9, 9], "bias_regularizer": null, "name": "conv_log2", "strides": [3, 3], "filters": 128, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv_log2", "class_name": "Conv2D", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"config": {"center": true, "trainable": true, "momentum": 0.99, "name": "bn2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"config": {"center": true, "trainable": true, "momentum": 0.99, "name": "bn_log2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "gamma_constraint": null, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "bn_log2", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_log2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "a2", "activation": "elu"}, "name": "a2", "class_name": "Activation", "inbound_nodes": [[["bn2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "a_log2", "activation": "elu"}, "name": "a_log2", "class_name": "Activation", "inbound_nodes": [[["bn_log2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pool2", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pool2", "class_name": "MaxPooling2D", "inbound_nodes": [[["a2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pool_log2", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pool_log2", "class_name": "MaxPooling2D", "inbound_nodes": [[["a_log2", 0, 0, {}]]]}, {"config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_5", "seed": null}, "name": "dropout_5", "class_name": "Dropout", "inbound_nodes": [[["max_pool2", 0, 0, {}]]]}, {"config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_6", "seed": null}, "name": "dropout_6", "class_name": "Dropout", "inbound_nodes": [[["max_pool_log2", 0, 0, {}]]]}, {"config": {"batch_input_shape": [null, 38], "dtype": "float32", "name": "In_params", "sparse": false}, "name": "In_params", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"batch_input_shape": [null, 20], "dtype": "float32", "name": "Out_params", "sparse": false}, "name": "Out_params", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"config": {"name": "flatten_2", "trainable": true, "data_format": "channels_last"}, "name": "flatten_2", "class_name": "Flatten", "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "concat_params", "function_type": "lambda", "arguments": {}, "output_shape_type": "raw", "output_shape": null, "function": ["4wEAAAAAAAAAAwAAAAQAAABDAAAAcyoAAAB8AABkAQAZfQEAfAAAZAIAGX0CAHQAAHwBAHwCAGcC\nAGQDAGQCAIMBAVMpBE7pAAAAAOkBAAAA2gRheGlzKQHaC2NvbmNhdGVuYXRlKQPaBWlucHV02gFh\n2gFiqQByCAAAAPoePGlweXRob24taW5wdXQtNi02MDdmYmU0YWE0NzQ+2g5jb25jYXRfdmVjdG9y\ncyUAAABzBgAAAAABCgEKAQ==\n", null, null]}, "name": "concat_params", "class_name": "Lambda", "inbound_nodes": [[["In_params", 0, 0, {}], ["Out_params", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "concat_images", "function_type": "lambda", "arguments": {}, "output_shape_type": "raw", "output_shape": null, "function": ["4wEAAAAAAAAAAwAAAAQAAABDAAAAcyoAAAB8AABkAQAZfQEAfAAAZAIAGX0CAHQAAHwBAHwCAGcC\nAGQDAGQCAIMBAVMpBE7pAAAAAOkBAAAA2gRheGlzKQHaC2NvbmNhdGVuYXRlKQPaBWlucHV02gFh\n2gFiqQByCAAAAPoePGlweXRob24taW5wdXQtNi02MDdmYmU0YWE0NzQ+2g5jb25jYXRfdmVjdG9y\ncyUAAABzBgAAAAABCgEKAQ==\n", null, null]}, "name": "concat_images", "class_name": "Lambda", "inbound_nodes": [[["flatten_1", 0, 0, {}], ["flatten_2", 0, 0, {}]]]}, {"config": {"center": true, "trainable": true, "momentum": 0.99, "name": "bn_params", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "scale": true, "epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "bn_params", "class_name": "BatchNormalization", "inbound_nodes": [[["concat_params", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "concat_all", "function_type": "lambda", "arguments": {}, "output_shape_type": "raw", "output_shape": null, "function": ["4wEAAAAAAAAAAwAAAAQAAABDAAAAcyoAAAB8AABkAQAZfQEAfAAAZAIAGX0CAHQAAHwBAHwCAGcC\nAGQDAGQCAIMBAVMpBE7pAAAAAOkBAAAA2gRheGlzKQHaC2NvbmNhdGVuYXRlKQPaBWlucHV02gFh\n2gFiqQByCAAAAPoePGlweXRob24taW5wdXQtNi02MDdmYmU0YWE0NzQ+2g5jb25jYXRfdmVjdG9y\ncyUAAABzBgAAAAABCgEKAQ==\n", null, null]}, "name": "concat_all", "class_name": "Lambda", "inbound_nodes": [[["concat_images", 0, 0, {}], ["bn_params", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "trainable": true, "name": "fc0", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "units": 100, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null}, "name": "fc0", "class_name": "Dense", "inbound_nodes": [[["concat_all", 0, 0, {}]]]}, {"config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_7", "seed": null}, "name": "dropout_7", "class_name": "Dropout", "inbound_nodes": [[["fc0", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "trainable": true, "name": "fc1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "units": 80, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null}, "name": "fc1", "class_name": "Dense", "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_8", "seed": null}, "name": "dropout_8", "class_name": "Dropout", "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "trainable": true, "name": "fc2", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "units": 60, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null}, "name": "fc2", "class_name": "Dense", "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_9", "seed": null}, "name": "dropout_9", "class_name": "Dropout", "inbound_nodes": [[["fc2", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "trainable": true, "name": "fc3", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "units": 40, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null}, "name": "fc3", "class_name": "Dense", "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}, {"config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_10", "seed": null}, "name": "dropout_10", "class_name": "Dropout", "inbound_nodes": [[["fc3", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "trainable": true, "name": "fc4", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "units": 20, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null}, "name": "fc4", "class_name": "Dense", "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}, {"config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_11", "seed": null}, "name": "dropout_11", "class_name": "Dropout", "inbound_nodes": [[["fc4", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "trainable": true, "name": "fc5", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "units": 10, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null}, "name": "fc5", "class_name": "Dense", "inbound_nodes": [[["dropout_11", 0, 0, {}]]]}, {"config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_12", "seed": null}, "name": "dropout_12", "class_name": "Dropout", "inbound_nodes": [[["fc5", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "trainable": true, "name": "sigmoid", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "kernel_constraint": null, "bias_constraint": null, "units": 1, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null}, "name": "sigmoid", "class_name": "Dense", "inbound_nodes": [[["dropout_12", 0, 0, {}]]]}], "output_layers": [["sigmoid", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4"}