{"class_name": "Model", "config": {"name": "model_10", "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "name": "Input", "dtype": "float32", "batch_input_shape": [null, 236, 348, 3]}, "name": "Input", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"filters": 16, "bias_regularizer": null, "kernel_regularizer": null, "padding": "valid", "name": "conv0", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "strides": [2, 2], "activity_regularizer": null, "use_bias": true, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [7, 7]}, "name": "conv0", "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn0", "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "center": true, "beta_constraint": null, "scale": true}, "name": "bn0", "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "a0", "trainable": true, "activation": "relu"}, "name": "a0", "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "padding": "valid", "pool_size": [1, 1], "name": "max_pool0", "data_format": "channels_last", "trainable": true}, "name": "max_pool0", "inbound_nodes": [[["a0", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_37", "seed": null, "trainable": true, "noise_shape": null}, "name": "dropout_37", "inbound_nodes": [[["max_pool0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "padding": "valid", "name": "conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "strides": [3, 3], "activity_regularizer": null, "use_bias": true, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [5, 5]}, "name": "conv1", "inbound_nodes": [[["dropout_37", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn1", "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "center": true, "beta_constraint": null, "scale": true}, "name": "bn1", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "a1", "trainable": true, "activation": "relu"}, "name": "a1", "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pool1", "data_format": "channels_last", "trainable": true}, "name": "max_pool1", "inbound_nodes": [[["a1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_38", "seed": null, "trainable": true, "noise_shape": null}, "name": "dropout_38", "inbound_nodes": [[["max_pool1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"filters": 128, "bias_regularizer": null, "kernel_regularizer": null, "padding": "valid", "name": "conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3]}, "name": "conv2", "inbound_nodes": [[["dropout_38", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn2", "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "center": true, "beta_constraint": null, "scale": true}, "name": "bn2", "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "a2", "trainable": true, "activation": "relu"}, "name": "a2", "inbound_nodes": [[["bn2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pool2", "data_format": "channels_last", "trainable": true}, "name": "max_pool2", "inbound_nodes": [[["a2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.3, "name": "dropout_39", "seed": null, "trainable": true, "noise_shape": null}, "name": "dropout_39", "inbound_nodes": [[["max_pool2", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_10", "data_format": "channels_last", "trainable": true}, "name": "flatten_10", "inbound_nodes": [[["dropout_39", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "units": 20, "name": "fc0", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "name": "fc0", "inbound_nodes": [[["flatten_10", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_40", "seed": null, "trainable": true, "noise_shape": null}, "name": "dropout_40", "inbound_nodes": [[["fc0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "units": 20, "name": "fc1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "name": "fc1", "inbound_nodes": [[["dropout_40", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "units": 1, "name": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "use_bias": true, "activation": "sigmoid", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "name": "sigmoid", "inbound_nodes": [[["fc1", 0, 0, {}]]]}], "output_layers": [["sigmoid", 0, 0]], "input_layers": [["Input", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.4"}