{"keras_version": "2.2.3", "class_name": "Model", "config": {"output_layers": [["sigmoid", 0, 0]], "input_layers": [["Input", 0, 0]], "name": "model_7", "layers": [{"name": "Input", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 236, 348, 3], "name": "Input"}, "class_name": "InputLayer"}, {"name": "conv0", "inbound_nodes": [[["Input", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "filters": 32, "padding": "valid", "bias_constraint": null, "kernel_size": [7, 7], "activity_regularizer": null, "dilation_rate": [1, 1], "strides": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "name": "conv0", "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "bn0", "inbound_nodes": [[["conv0", 0, 0, {}]]], "config": {"trainable": true, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn0", "scale": true}, "class_name": "BatchNormalization"}, {"name": "a0", "inbound_nodes": [[["bn0", 0, 0, {}]]], "config": {"trainable": true, "name": "a0", "activation": "relu"}, "class_name": "Activation"}, {"name": "max_pool0", "inbound_nodes": [[["a0", 0, 0, {}]]], "config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pool0"}, "class_name": "MaxPooling2D"}, {"name": "dropout_41", "inbound_nodes": [[["max_pool0", 0, 0, {}]]], "config": {"trainable": true, "seed": null, "name": "dropout_41", "rate": 0.4, "noise_shape": null}, "class_name": "Dropout"}, {"name": "conv1", "inbound_nodes": [[["dropout_41", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "filters": 128, "padding": "valid", "bias_constraint": null, "kernel_size": [5, 5], "activity_regularizer": null, "dilation_rate": [1, 1], "strides": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "name": "conv1", "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "bn1", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"trainable": true, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn1", "scale": true}, "class_name": "BatchNormalization"}, {"name": "a1", "inbound_nodes": [[["bn1", 0, 0, {}]]], "config": {"trainable": true, "name": "a1", "activation": "relu"}, "class_name": "Activation"}, {"name": "max_pool1", "inbound_nodes": [[["a1", 0, 0, {}]]], "config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pool1"}, "class_name": "MaxPooling2D"}, {"name": "dropout_42", "inbound_nodes": [[["max_pool1", 0, 0, {}]]], "config": {"trainable": true, "seed": null, "name": "dropout_42", "rate": 0.4, "noise_shape": null}, "class_name": "Dropout"}, {"name": "conv2", "inbound_nodes": [[["dropout_42", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "filters": 256, "padding": "valid", "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "name": "conv2", "kernel_constraint": null}, "class_name": "Conv2D"}, {"name": "bn2", "inbound_nodes": [[["conv2", 0, 0, {}]]], "config": {"trainable": true, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2", "scale": true}, "class_name": "BatchNormalization"}, {"name": "a2", "inbound_nodes": [[["bn2", 0, 0, {}]]], "config": {"trainable": true, "name": "a2", "activation": "relu"}, "class_name": "Activation"}, {"name": "max_pool2", "inbound_nodes": [[["a2", 0, 0, {}]]], "config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [1, 1], "strides": [1, 1], "name": "max_pool2"}, "class_name": "MaxPooling2D"}, {"name": "dropout_43", "inbound_nodes": [[["max_pool2", 0, 0, {}]]], "config": {"trainable": true, "seed": null, "name": "dropout_43", "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"name": "flatten_7", "inbound_nodes": [[["dropout_43", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_7"}, "class_name": "Flatten"}, {"name": "fc0", "inbound_nodes": [[["flatten_7", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "units": 20, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "fc0", "kernel_constraint": null}, "class_name": "Dense"}, {"name": "dropout_44", "inbound_nodes": [[["fc0", 0, 0, {}]]], "config": {"trainable": true, "seed": null, "name": "dropout_44", "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"name": "fc1", "inbound_nodes": [[["dropout_44", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "fc1", "kernel_constraint": null}, "class_name": "Dense"}, {"name": "sigmoid", "inbound_nodes": [[["fc1", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "sigmoid", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "sigmoid", "kernel_constraint": null}, "class_name": "Dense"}]}, "backend": "tensorflow"}