{"keras_version": "2.2.3", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "name": "Input", "config": {"dtype": "float32", "batch_input_shape": [null, 236, 348, 3], "sparse": false, "name": "Input"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["Input", 0, 0, {}]]], "name": "conv0", "config": {"kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "filters": 32, "name": "conv0", "use_bias": true, "data_format": "channels_last", "kernel_size": [7, 7], "strides": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv0", 0, 0, {}]]], "name": "bn0", "config": {"trainable": true, "beta_regularizer": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "name": "bn0", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn0", 0, 0, {}]]], "name": "a0", "config": {"activation": "relu", "trainable": true, "name": "a0"}, "class_name": "Activation"}, {"inbound_nodes": [[["a0", 0, 0, {}]]], "name": "max_pool0", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pool0", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pool0", 0, 0, {}]]], "name": "dropout_41", "config": {"noise_shape": null, "trainable": true, "rate": 0.4, "name": "dropout_41", "seed": null}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_41", 0, 0, {}]]], "name": "conv1", "config": {"kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "filters": 128, "name": "conv1", "use_bias": true, "data_format": "channels_last", "kernel_size": [5, 5], "strides": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "bn1", "config": {"trainable": true, "beta_regularizer": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "name": "bn1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn1", 0, 0, {}]]], "name": "a1", "config": {"activation": "relu", "trainable": true, "name": "a1"}, "class_name": "Activation"}, {"inbound_nodes": [[["a1", 0, 0, {}]]], "name": "max_pool1", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pool1", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pool1", 0, 0, {}]]], "name": "dropout_42", "config": {"noise_shape": null, "trainable": true, "rate": 0.4, "name": "dropout_42", "seed": null}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_42", 0, 0, {}]]], "name": "conv2", "config": {"kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "filters": 256, "name": "conv2", "use_bias": true, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2", 0, 0, {}]]], "name": "bn2", "config": {"trainable": true, "beta_regularizer": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "name": "bn2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn2", 0, 0, {}]]], "name": "a2", "config": {"activation": "relu", "trainable": true, "name": "a2"}, "class_name": "Activation"}, {"inbound_nodes": [[["a2", 0, 0, {}]]], "name": "max_pool2", "config": {"data_format": "channels_last", "trainable": true, "strides": [1, 1], "name": "max_pool2", "padding": "valid", "pool_size": [1, 1]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pool2", 0, 0, {}]]], "name": "dropout_43", "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "name": "dropout_43", "seed": null}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_43", 0, 0, {}]]], "name": "flatten_7", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_7"}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_7", 0, 0, {}]]], "name": "fc0", "config": {"kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "name": "fc0", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 20, "bias_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["fc0", 0, 0, {}]]], "name": "dropout_44", "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "name": "dropout_44", "seed": null}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_44", 0, 0, {}]]], "name": "fc1", "config": {"kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "name": "fc1", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "bias_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["fc1", 0, 0, {}]]], "name": "sigmoid", "config": {"kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "name": "sigmoid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "bias_regularizer": null}, "class_name": "Dense"}], "name": "model_7", "input_layers": [["Input", 0, 0]], "output_layers": [["sigmoid", 0, 0]]}, "backend": "tensorflow"}