{"backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["In_params", 0, 0], ["Out_params", 0, 0]], "output_layers": [["sigmoid", 0, 0]], "layers": [{"name": "In_params", "inbound_nodes": [], "config": {"batch_input_shape": [null, 38], "dtype": "float32", "name": "In_params", "sparse": false}, "class_name": "InputLayer"}, {"name": "Out_params", "inbound_nodes": [], "config": {"batch_input_shape": [null, 20], "dtype": "float32", "name": "Out_params", "sparse": false}, "class_name": "InputLayer"}, {"name": "concat_params", "inbound_nodes": [[["In_params", 0, 0, {}], ["Out_params", 0, 0, {}]]], "config": {"name": "concat_params", "output_shape_type": "raw", "function_type": "lambda", "arguments": {}, "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAQAAABDAAAAcyoAAAB8AABkAQAZfQEAfAAAZAIAGX0CAHQAAHwBAHwCAGcC\nAGQDAGQCAIMBAVMpBE7pAAAAAOkBAAAA2gRheGlzKQHaC2NvbmNhdGVuYXRlKQPaBWlucHV02gFh\n2gFiqQByCAAAAPofPGlweXRob24taW5wdXQtMTAtYjczN2U3MzcwNGYzPtoOY29uY2F0X3ZlY3Rv\ncnMFAAAAcwYAAAAAAQoBCgE=\n", null, null], "output_shape": null}, "class_name": "Lambda"}, {"name": "bn_params", "inbound_nodes": [[["concat_params", 0, 0, {}]]], "config": {"name": "bn_params", "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"name": "fc0", "inbound_nodes": [[["bn_params", 0, 0, {}]]], "config": {"bias_regularizer": null, "name": "fc0", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "units": 100, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"name": "dropout_5", "inbound_nodes": [[["fc0", 0, 0, {}]]], "config": {"name": "dropout_5", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.4}, "class_name": "Dropout"}, {"name": "fc1", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "config": {"bias_regularizer": null, "name": "fc1", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "units": 500, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"name": "dropout_6", "inbound_nodes": [[["fc1", 0, 0, {}]]], "config": {"name": "dropout_6", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"name": "fc2", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"bias_regularizer": null, "name": "fc2", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "units": 300, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"name": "dropout_7", "inbound_nodes": [[["fc2", 0, 0, {}]]], "config": {"name": "dropout_7", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.4}, "class_name": "Dropout"}, {"name": "fc3", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "config": {"bias_regularizer": null, "name": "fc3", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "units": 100, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"name": "dropout_8", "inbound_nodes": [[["fc3", 0, 0, {}]]], "config": {"name": "dropout_8", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.3}, "class_name": "Dropout"}, {"name": "fc4", "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "config": {"bias_regularizer": null, "name": "fc4", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "units": 20, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"name": "sigmoid", "inbound_nodes": [[["fc4", 0, 0, {}]]], "config": {"bias_regularizer": null, "name": "sigmoid", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "units": 1, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "class_name": "Model"}