{"config": {"layers": [{"config": {"sparse": false, "batch_input_shape": [null, 236, 348, 3], "name": "Input", "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "Input"}, {"config": {"bias_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "name": "conv0", "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [4, 4], "filters": 32, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [7, 7], "trainable": true}, "inbound_nodes": [[["Input", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv0"}, {"config": {"scale": true, "axis": 3, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "bn0", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["conv0", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn0"}, {"config": {"name": "a0", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn0", 0, 0, {}]]], "class_name": "Activation", "name": "a0"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pool0", "trainable": true}, "inbound_nodes": [[["a0", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pool0"}, {"config": {"noise_shape": null, "rate": 0.4, "seed": null, "trainable": true, "name": "dropout_41"}, "inbound_nodes": [[["max_pool0", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_41"}, {"config": {"bias_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "name": "conv1", "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [3, 3], "filters": 128, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "trainable": true}, "inbound_nodes": [[["dropout_41", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv1"}, {"config": {"scale": true, "axis": 3, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "bn1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn1"}, {"config": {"name": "a1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn1", 0, 0, {}]]], "class_name": "Activation", "name": "a1"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pool1", "trainable": true}, "inbound_nodes": [[["a1", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pool1"}, {"config": {"noise_shape": null, "rate": 0.4, "seed": null, "trainable": true, "name": "dropout_42"}, "inbound_nodes": [[["max_pool1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_42"}, {"config": {"bias_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "name": "conv2", "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "filters": 256, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "trainable": true}, "inbound_nodes": [[["dropout_42", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2"}, {"config": {"scale": true, "axis": 3, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "bn2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["conv2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn2"}, {"config": {"name": "a2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn2", 0, 0, {}]]], "class_name": "Activation", "name": "a2"}, {"config": {"data_format": "channels_last", "pool_size": [1, 1], "strides": [1, 1], "padding": "valid", "name": "max_pool2", "trainable": true}, "inbound_nodes": [[["a2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pool2"}, {"config": {"noise_shape": null, "rate": 0.2, "seed": null, "trainable": true, "name": "dropout_43"}, "inbound_nodes": [[["max_pool2", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_43"}, {"config": {"data_format": "channels_last", "name": "flatten_7", "trainable": true}, "inbound_nodes": [[["dropout_43", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_7"}, {"config": {"bias_regularizer": null, "activation": "relu", "use_bias": true, "bias_constraint": null, "name": "fc0", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 20, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["flatten_7", 0, 0, {}]]], "class_name": "Dense", "name": "fc0"}, {"config": {"noise_shape": null, "rate": 0.2, "seed": null, "trainable": true, "name": "dropout_44"}, "inbound_nodes": [[["fc0", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_44"}, {"config": {"bias_regularizer": null, "activation": "relu", "use_bias": true, "bias_constraint": null, "name": "fc1", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["dropout_44", 0, 0, {}]]], "class_name": "Dense", "name": "fc1"}, {"config": {"bias_regularizer": null, "activation": "sigmoid", "use_bias": true, "bias_constraint": null, "name": "sigmoid", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["fc1", 0, 0, {}]]], "class_name": "Dense", "name": "sigmoid"}], "name": "model_7", "input_layers": [["Input", 0, 0]], "output_layers": [["sigmoid", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.3"}