{"class_name": "Model", "config": {"name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "Input", "batch_input_shape": [null, 236, 348, 3]}, "name": "Input"}, {"inbound_nodes": [[["Input", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "name": "conv0", "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [2, 2], "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "padding": "valid", "trainable": true, "bias_constraint": null, "kernel_regularizer": null}, "name": "conv0"}, {"inbound_nodes": [[["conv0", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn0", "center": true, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}, "name": "bn0"}, {"inbound_nodes": [[["bn0", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "a0", "activation": "relu"}, "name": "a0"}, {"inbound_nodes": [[["a0", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pool0", "padding": "valid", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}, "name": "max_pool0"}, {"inbound_nodes": [[["max_pool0", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.4, "seed": null}, "name": "dropout_1"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "name": "conv1", "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [2, 2], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "padding": "valid", "trainable": true, "bias_constraint": null, "kernel_regularizer": null}, "name": "conv1"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn1", "center": true, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}, "name": "bn1"}, {"inbound_nodes": [[["bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "a1", "activation": "relu"}, "name": "a1"}, {"inbound_nodes": [[["a1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pool1", "padding": "valid", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}, "name": "max_pool1"}, {"inbound_nodes": [[["max_pool1", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "noise_shape": null, "rate": 0.4, "seed": null}, "name": "dropout_2"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "name": "conv2", "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [2, 2], "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "padding": "valid", "trainable": true, "bias_constraint": null, "kernel_regularizer": null}, "name": "conv2"}, {"inbound_nodes": [[["conv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2", "center": true, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}, "name": "bn2"}, {"inbound_nodes": [[["bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "a2", "activation": "relu"}, "name": "a2"}, {"inbound_nodes": [[["a2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pool2", "padding": "valid", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}, "name": "max_pool2"}, {"inbound_nodes": [[["max_pool2", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "noise_shape": null, "rate": 0.2, "seed": null}, "name": "dropout_3"}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "name": "conv3", "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "strides": [1, 1], "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "padding": "valid", "trainable": true, "bias_constraint": null, "kernel_regularizer": null}, "name": "conv3"}, {"inbound_nodes": [[["conv3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3", "center": true, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}, "name": "bn3"}, {"inbound_nodes": [[["bn3", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "a3", "activation": "relu"}, "name": "a3"}, {"inbound_nodes": [[["a3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pool3", "padding": "valid", "data_format": "channels_last", "trainable": true, "strides": [1, 1], "pool_size": [1, 1]}, "name": "max_pool3"}, {"inbound_nodes": [[["max_pool3", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "noise_shape": null, "rate": 0.2, "seed": null}, "name": "dropout_4"}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "name": "flatten_1"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "fc0", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "units": 30, "kernel_regularizer": null}, "name": "fc0"}, {"inbound_nodes": [[["fc0", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "noise_shape": null, "rate": 0.2, "seed": null}, "name": "dropout_5"}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "fc1", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "units": 30, "kernel_regularizer": null}, "name": "fc1"}, {"inbound_nodes": [[["fc1", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "sigmoid", "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "units": 1, "kernel_regularizer": null}, "name": "sigmoid"}], "input_layers": [["Input", 0, 0]], "output_layers": [["sigmoid", 0, 0]]}, "keras_version": "2.2.3", "backend": "tensorflow"}