{"backend": "tensorflow", "keras_version": "2.2.3", "config": {"name": "model_7", "layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 236, 348, 3], "name": "Input", "sparse": false}, "name": "Input", "class_name": "InputLayer"}, {"inbound_nodes": [[["Input", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "strides": [4, 4], "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [7, 7], "trainable": true, "name": "conv0", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 32}, "name": "conv0", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv0", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "center": true, "beta_constraint": null, "name": "bn0", "axis": 3}, "name": "bn0", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn0", 0, 0, {}]]], "config": {"trainable": true, "name": "a0", "activation": "relu"}, "name": "a0", "class_name": "Activation"}, {"inbound_nodes": [[["a0", 0, 0, {}]]], "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pool0"}, "name": "max_pool0", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pool0", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.4, "trainable": true, "name": "dropout_41", "seed": null}, "name": "dropout_41", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_41", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "strides": [3, 3], "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [5, 5], "trainable": true, "name": "conv1", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 128}, "name": "conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "center": true, "beta_constraint": null, "name": "bn1", "axis": 3}, "name": "bn1", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn1", 0, 0, {}]]], "config": {"trainable": true, "name": "a1", "activation": "relu"}, "name": "a1", "class_name": "Activation"}, {"inbound_nodes": [[["a1", 0, 0, {}]]], "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pool1"}, "name": "max_pool1", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pool1", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.4, "trainable": true, "name": "dropout_42", "seed": null}, "name": "dropout_42", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_42", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "name": "conv2", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 256}, "name": "conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "center": true, "beta_constraint": null, "name": "bn2", "axis": 3}, "name": "bn2", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn2", 0, 0, {}]]], "config": {"trainable": true, "name": "a2", "activation": "relu"}, "name": "a2", "class_name": "Activation"}, {"inbound_nodes": [[["a2", 0, 0, {}]]], "config": {"data_format": "channels_last", "strides": [1, 1], "padding": "valid", "pool_size": [1, 1], "trainable": true, "name": "max_pool2"}, "name": "max_pool2", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pool2", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_43", "seed": null}, "name": "dropout_43", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_43", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_7"}, "name": "flatten_7", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_7", 0, 0, {}]]], "config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "units": 20, "trainable": true, "name": "fc0", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "name": "fc0", "class_name": "Dense"}, {"inbound_nodes": [[["fc0", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "dropout_44", "seed": null}, "name": "dropout_44", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_44", 0, 0, {}]]], "config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "units": 10, "trainable": true, "name": "fc1", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "name": "fc1", "class_name": "Dense"}, {"inbound_nodes": [[["fc1", 0, 0, {}]]], "config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "sigmoid", "kernel_regularizer": null, "units": 1, "trainable": true, "name": "sigmoid", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "name": "sigmoid", "class_name": "Dense"}], "input_layers": [["Input", 0, 0]], "output_layers": [["sigmoid", 0, 0]]}, "class_name": "Model"}