{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 236, 348, 3], "sparse": false, "dtype": "float32", "name": "Input"}, "class_name": "InputLayer", "name": "Input"}, {"inbound_nodes": [[["Input", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "data_format": "channels_last", "name": "conv0", "kernel_constraint": null, "filters": 32, "padding": "valid", "kernel_regularizer": null, "strides": [2, 2], "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [5, 5], "bias_constraint": null}, "class_name": "Conv2D", "name": "conv0"}, {"inbound_nodes": [[["conv0", 0, 0, {}]]], "config": {"trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "momentum": 0.99, "name": "bn0", "beta_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "gamma_regularizer": null, "scale": true}, "class_name": "BatchNormalization", "name": "bn0"}, {"inbound_nodes": [[["bn0", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "a0"}, "class_name": "Activation", "name": "a0"}, {"inbound_nodes": [[["a0", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "max_pool0", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pool0"}, {"inbound_nodes": [[["max_pool0", 0, 0, {}]]], "config": {"seed": null, "noise_shape": null, "trainable": true, "rate": 0.4, "name": "dropout_13"}, "class_name": "Dropout", "name": "dropout_13"}, {"inbound_nodes": [[["dropout_13", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "data_format": "channels_last", "name": "conv1", "kernel_constraint": null, "filters": 128, "padding": "valid", "kernel_regularizer": null, "strides": [2, 2], "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [5, 5], "bias_constraint": null}, "class_name": "Conv2D", "name": "conv1"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "momentum": 0.99, "name": "bn1", "beta_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "gamma_regularizer": null, "scale": true}, "class_name": "BatchNormalization", "name": "bn1"}, {"inbound_nodes": [[["bn1", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "a1"}, "class_name": "Activation", "name": "a1"}, {"inbound_nodes": [[["a1", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "max_pool1", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pool1"}, {"inbound_nodes": [[["max_pool1", 0, 0, {}]]], "config": {"seed": null, "noise_shape": null, "trainable": true, "rate": 0.3, "name": "dropout_14"}, "class_name": "Dropout", "name": "dropout_14"}, {"inbound_nodes": [[["dropout_14", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "data_format": "channels_last", "name": "conv2", "kernel_constraint": null, "filters": 256, "padding": "valid", "kernel_regularizer": null, "strides": [2, 2], "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [4, 4], "bias_constraint": null}, "class_name": "Conv2D", "name": "conv2"}, {"inbound_nodes": [[["conv2", 0, 0, {}]]], "config": {"trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "momentum": 0.99, "name": "bn2", "beta_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "gamma_regularizer": null, "scale": true}, "class_name": "BatchNormalization", "name": "bn2"}, {"inbound_nodes": [[["bn2", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "a2"}, "class_name": "Activation", "name": "a2"}, {"inbound_nodes": [[["a2", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "max_pool2", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pool2"}, {"inbound_nodes": [[["max_pool2", 0, 0, {}]]], "config": {"seed": null, "noise_shape": null, "trainable": true, "rate": 0.2, "name": "dropout_15"}, "class_name": "Dropout", "name": "dropout_15"}, {"inbound_nodes": [[["dropout_15", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_4"}, "class_name": "Flatten", "name": "flatten_4"}, {"inbound_nodes": [[["flatten_4", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "relu", "name": "fc0", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 20, "bias_constraint": null}, "class_name": "Dense", "name": "fc0"}, {"inbound_nodes": [], "config": {"batch_input_shape": [null, 54], "sparse": false, "dtype": "float32", "name": "Params"}, "class_name": "InputLayer", "name": "Params"}, {"inbound_nodes": [[["fc0", 0, 0, {}]]], "config": {"seed": null, "noise_shape": null, "trainable": true, "rate": 0.2, "name": "dropout_16"}, "class_name": "Dropout", "name": "dropout_16"}, {"inbound_nodes": [[["Params", 0, 0, {}]]], "config": {"trainable": true, "activation": "tanh", "name": "param_act"}, "class_name": "Activation", "name": "param_act"}, {"inbound_nodes": [[["dropout_16", 0, 0, {}], ["param_act", 0, 0, {}]]], "config": {"function": ["4wEAAAAAAAAAAwAAAAQAAABDAAAAcyoAAAB8AABkAQAZfQEAfAAAZAIAGX0CAHQAAHwBAHwCAGcC\nAGQDAGQCAIMBAVMpBE7pAAAAAOkBAAAA2gRheGlzKQHaC2NvbmNhdGVuYXRlKQPaBWlucHV02gFh\n2gFiqQByCAAAAPoePGlweXRob24taW5wdXQtOS0yMzY0N2Y5OWQ4NzE+2g1jb25jYXRfcGFyYW1z\nAQAAAHMGAAAAAAEKAQoB\n", null, null], "trainable": true, "arguments": {}, "name": "concat_params", "output_shape_type": "raw", "output_shape": null, "function_type": "lambda"}, "class_name": "Lambda", "name": "concat_params"}, {"inbound_nodes": [[["concat_params", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "relu", "name": "fc1", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 10, "bias_constraint": null}, "class_name": "Dense", "name": "fc1"}, {"inbound_nodes": [[["fc1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "sigmoid", "name": "sigmoid", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 1, "bias_constraint": null}, "class_name": "Dense", "name": "sigmoid"}], "input_layers": [["Input", 0, 0], ["Params", 0, 0]], "output_layers": [["sigmoid", 0, 0]], "name": "model_3"}, "class_name": "Model"}