{"config": {"name": "model_10", "layers": [{"name": "Input", "config": {"name": "Input", "batch_input_shape": [null, 236, 348, 3], "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv0", "config": {"name": "conv0", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "filters": 32, "strides": [2, 2], "kernel_size": [5, 5], "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_constraint": null, "trainable": true, "activity_regularizer": null}, "inbound_nodes": [[["Input", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "bn0", "config": {"name": "bn0", "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["conv0", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "a0", "config": {"name": "a0", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn0", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pool0", "config": {"name": "max_pool0", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid"}, "inbound_nodes": [[["a0", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_61", "config": {"name": "dropout_61", "rate": 0.4, "trainable": true, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pool0", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv1", "config": {"name": "conv1", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "filters": 128, "strides": [2, 2], "kernel_size": [5, 5], "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_constraint": null, "trainable": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_61", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "bn1", "config": {"name": "bn1", "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "a1", "config": {"name": "a1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pool1", "config": {"name": "max_pool1", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid"}, "inbound_nodes": [[["a1", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_62", "config": {"name": "dropout_62", "rate": 0.3, "trainable": true, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pool1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2", "config": {"name": "conv2", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "filters": 256, "strides": [2, 2], "kernel_size": [4, 4], "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_constraint": null, "trainable": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_62", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "bn2", "config": {"name": "bn2", "center": true, "beta_regularizer": null, "gamma_constraint": null, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "trainable": true}, "inbound_nodes": [[["conv2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "a2", "config": {"name": "a2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["bn2", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pool2", "config": {"name": "max_pool2", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid"}, "inbound_nodes": [[["a2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_63", "config": {"name": "dropout_63", "rate": 0.2, "trainable": true, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pool2", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "flatten_16", "config": {"name": "flatten_16", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_63", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "fc0", "config": {"name": "fc0", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "units": 20, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "bias_regularizer": null}, "inbound_nodes": [[["flatten_16", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_64", "config": {"name": "dropout_64", "rate": 0.2, "trainable": true, "noise_shape": null, "seed": null}, "inbound_nodes": [[["fc0", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "Chi", "config": {"name": "Chi", "batch_input_shape": [null, 1], "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "concat_chi", "config": {"output_shape": null, "name": "concat_chi", "function": ["4wEAAAAAAAAAAwAAAAQAAABDAAAAcyoAAAB8AABkAQAZfQEAfAAAZAIAGX0CAHQAAHwBAHwCAGcC\nAGQDAGQCAIMBAVMpBE7pAAAAAOkBAAAA2gRheGlzKQHaC2NvbmNhdGVuYXRlKQPaBWlucHV02gFh\n2gFiqQByCAAAAPofPGlweXRob24taW5wdXQtNjEtMjIyMTk5OWJmZTc1PtoKY29uY2F0X2NoaQEA\nAABzBgAAAAABCgEKAQ==\n", null, null], "output_shape_type": "raw", "function_type": "lambda", "trainable": true, "arguments": {}}, "inbound_nodes": [[["dropout_64", 0, 0, {}], ["Chi", 0, 0, {}]]], "class_name": "Lambda"}, {"name": "fc1", "config": {"name": "fc1", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "units": 10, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "bias_regularizer": null}, "inbound_nodes": [[["concat_chi", 0, 0, {}]]], "class_name": "Dense"}, {"name": "sigmoid", "config": {"name": "sigmoid", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "units": 1, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "trainable": true, "bias_regularizer": null}, "inbound_nodes": [[["fc1", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["Input", 0, 0], ["Chi", 0, 0]], "output_layers": [["sigmoid", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Model"}