{"backend": "tensorflow", "config": {"name": "model_1", "output_layers": [["sigmoid", 0, 0]], "input_layers": [["Input", 0, 0]], "layers": [{"name": "Input", "config": {"name": "Input", "batch_input_shape": [null, 236, 348, 3], "sparse": false, "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv0", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "padding": "valid", "trainable": true, "filters": 16, "kernel_regularizer": null, "bias_constraint": null, "name": "conv0", "use_bias": true, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"name": "bn0", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "epsilon": 0.001, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "bn0", "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"name": "a0", "config": {"name": "a0", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"name": "max_pool0", "config": {"name": "max_pool0", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["a0", 0, 0, {}]]]}, {"name": "dropout_1", "config": {"noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.4, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["max_pool0", 0, 0, {}]]]}, {"name": "conv1", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "padding": "valid", "trainable": true, "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "name": "conv1", "use_bias": true, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "bn1", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "epsilon": 0.001, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "bn1", "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "a1", "config": {"name": "a1", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"name": "max_pool1", "config": {"name": "max_pool1", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["a1", 0, 0, {}]]]}, {"name": "dropout_2", "config": {"noise_shape": null, "name": "dropout_2", "seed": null, "rate": 0.4, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["max_pool1", 0, 0, {}]]]}, {"name": "conv2", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "padding": "valid", "trainable": true, "filters": 256, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2", "use_bias": true, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "bn2", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "epsilon": 0.001, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "bn2", "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"name": "a2", "config": {"name": "a2", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn2", 0, 0, {}]]]}, {"name": "max_pool2", "config": {"name": "max_pool2", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["a2", 0, 0, {}]]]}, {"name": "dropout_3", "config": {"noise_shape": null, "name": "dropout_3", "seed": null, "rate": 0.2, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["max_pool2", 0, 0, {}]]]}, {"name": "conv3", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "padding": "valid", "trainable": true, "filters": 1024, "kernel_regularizer": null, "bias_constraint": null, "name": "conv3", "use_bias": true, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "bn3", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "epsilon": 0.001, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "bn3", "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv3", 0, 0, {}]]]}, {"name": "a3", "config": {"name": "a3", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn3", 0, 0, {}]]]}, {"name": "max_pool3", "config": {"name": "max_pool3", "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [1, 1], "strides": [1, 1]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["a3", 0, 0, {}]]]}, {"name": "dropout_4", "config": {"noise_shape": null, "name": "dropout_4", "seed": null, "rate": 0.2, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["max_pool3", 0, 0, {}]]]}, {"name": "flatten_1", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "fc0", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "name": "fc0", "units": 30, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dropout_5", "config": {"noise_shape": null, "name": "dropout_5", "seed": null, "rate": 0.2, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["fc0", 0, 0, {}]]]}, {"name": "fc1", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "name": "fc1", "units": 30, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "sigmoid", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "name": "sigmoid", "units": 1, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "sigmoid", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["fc1", 0, 0, {}]]]}]}, "class_name": "Model", "keras_version": "2.2.3"}