{"backend": "tensorflow", "class_name": "Model", "config": {"name": "model_2", "output_layers": [["sigmoid", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "Input", "config": {"dtype": "float32", "name": "Input", "sparse": false, "batch_input_shape": [null, 236, 348, 3]}, "inbound_nodes": []}, {"class_name": "InputLayer", "name": "InputLog", "config": {"dtype": "float32", "name": "InputLog", "sparse": false, "batch_input_shape": [null, 236, 348, 3]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv0", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [2, 2], "name": "conv0", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [5, 5], "data_format": "channels_last", "kernel_constraint": null, "padding": "valid", "kernel_regularizer": null}, "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_log0", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [2, 2], "name": "conv_log0", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [5, 5], "data_format": "channels_last", "kernel_constraint": null, "padding": "valid", "kernel_regularizer": null}, "inbound_nodes": [[["InputLog", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn0", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn0", "momentum": 0.99, "center": true, "gamma_regularizer": null, "scale": true, "axis": 3, "beta_constraint": null}, "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn_log0", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_log0", "momentum": 0.99, "center": true, "gamma_regularizer": null, "scale": true, "axis": 3, "beta_constraint": null}, "inbound_nodes": [[["conv_log0", 0, 0, {}]]]}, {"class_name": "Activation", "name": "a0", "config": {"trainable": true, "activation": "relu", "name": "a0"}, "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"class_name": "Activation", "name": "a_log0", "config": {"trainable": true, "activation": "relu", "name": "a_log0"}, "inbound_nodes": [[["bn_log0", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pool0", "config": {"strides": [2, 2], "name": "max_pool0", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["a0", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pool_log0", "config": {"strides": [2, 2], "name": "max_pool_log0", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["a_log0", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_10", "config": {"noise_shape": null, "trainable": true, "rate": 0.4, "name": "dropout_10", "seed": null}, "inbound_nodes": [[["max_pool0", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_11", "config": {"noise_shape": null, "trainable": true, "rate": 0.4, "name": "dropout_11", "seed": null}, "inbound_nodes": [[["max_pool_log0", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "strides": [2, 2], "name": "conv1", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [5, 5], "data_format": "channels_last", "kernel_constraint": null, "padding": "valid", "kernel_regularizer": null}, "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_log1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "strides": [2, 2], "name": "conv_log1", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [5, 5], "data_format": "channels_last", "kernel_constraint": null, "padding": "valid", "kernel_regularizer": null}, "inbound_nodes": [[["dropout_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn1", "momentum": 0.99, "center": true, "gamma_regularizer": null, "scale": true, "axis": 3, "beta_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn_log1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_log1", "momentum": 0.99, "center": true, "gamma_regularizer": null, "scale": true, "axis": 3, "beta_constraint": null}, "inbound_nodes": [[["conv_log1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "a1", "config": {"trainable": true, "activation": "relu", "name": "a1"}, "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "a_log1", "config": {"trainable": true, "activation": "relu", "name": "a_log1"}, "inbound_nodes": [[["bn_log1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pool1", "config": {"strides": [2, 2], "name": "max_pool1", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["a1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pool_log1", "config": {"strides": [2, 2], "name": "max_pool_log1", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["a_log1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_12", "config": {"noise_shape": null, "trainable": true, "rate": 0.3, "name": "dropout_12", "seed": null}, "inbound_nodes": [[["max_pool1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_13", "config": {"noise_shape": null, "trainable": true, "rate": 0.3, "name": "dropout_13", "seed": null}, "inbound_nodes": [[["max_pool_log1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "strides": [2, 2], "name": "conv2", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [4, 4], "data_format": "channels_last", "kernel_constraint": null, "padding": "valid", "kernel_regularizer": null}, "inbound_nodes": [[["dropout_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_log2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "strides": [2, 2], "name": "conv_log2", "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [4, 4], "data_format": "channels_last", "kernel_constraint": null, "padding": "valid", "kernel_regularizer": null}, "inbound_nodes": [[["dropout_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2", "momentum": 0.99, "center": true, "gamma_regularizer": null, "scale": true, "axis": 3, "beta_constraint": null}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn_log2", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_log2", "momentum": 0.99, "center": true, "gamma_regularizer": null, "scale": true, "axis": 3, "beta_constraint": null}, "inbound_nodes": [[["conv_log2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "a2", "config": {"trainable": true, "activation": "relu", "name": "a2"}, "inbound_nodes": [[["bn2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "a_log2", "config": {"trainable": true, "activation": "relu", "name": "a_log2"}, "inbound_nodes": [[["bn_log2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pool2", "config": {"strides": [2, 2], "name": "max_pool2", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["a2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pool_log2", "config": {"strides": [2, 2], "name": "max_pool_log2", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["a_log2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_14", "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "name": "dropout_14", "seed": null}, "inbound_nodes": [[["max_pool2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_15", "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "name": "dropout_15", "seed": null}, "inbound_nodes": [[["max_pool_log2", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_3", "config": {"trainable": true, "name": "flatten_3", "data_format": "channels_last"}, "inbound_nodes": [[["dropout_14", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_4", "config": {"trainable": true, "name": "flatten_4", "data_format": "channels_last"}, "inbound_nodes": [[["dropout_15", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc0", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "fc0", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "activation": "relu", "bias_constraint": null, "units": 20, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null}, "inbound_nodes": [[["flatten_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc0_log", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "fc0_log", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "activation": "relu", "bias_constraint": null, "units": 20, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null}, "inbound_nodes": [[["flatten_4", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_16", "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "name": "dropout_16", "seed": null}, "inbound_nodes": [[["fc0", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_17", "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "name": "dropout_17", "seed": null}, "inbound_nodes": [[["fc0_log", 0, 0, {}]]]}, {"class_name": "Lambda", "name": "concat_layer", "config": {"arguments": {}, "output_shape_type": "raw", "name": "concat_layer", "trainable": true, "function_type": "lambda", "output_shape": null, "function": ["4wEAAAAAAAAAAwAAAAQAAABDAAAAcyoAAAB8AABkAQAZfQEAfAAAZAIAGX0CAHQAAHwBAHwCAGcC\nAGQDAGQCAIMBAVMpBE7pAAAAAOkBAAAA2gRheGlzKQHaC2NvbmNhdGVuYXRlKQPaBWlucHV02gFh\n2gFiqQByCAAAAPoePGlweXRob24taW5wdXQtNy01NmZhNWRkMmI4NGY+2g5jb25jYXRfdmVjdG9y\ncwEAAABzBgAAAAABCgEKAQ==\n", null, null]}, "inbound_nodes": [[["dropout_16", 0, 0, {}], ["dropout_17", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "fc1", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "activation": "relu", "bias_constraint": null, "units": 10, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null}, "inbound_nodes": [[["concat_layer", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_18", "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "name": "dropout_18", "seed": null}, "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "fc2", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "activation": "relu", "bias_constraint": null, "units": 10, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null}, "inbound_nodes": [[["dropout_18", 0, 0, {}]]]}, {"class_name": "Dense", "name": "sigmoid", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "sigmoid", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "activation": "sigmoid", "bias_constraint": null, "units": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null}, "inbound_nodes": [[["fc2", 0, 0, {}]]]}], "input_layers": [["Input", 0, 0], ["InputLog", 0, 0]]}, "keras_version": "2.2.4"}