{"class_name": "Model", "config": {"input_layers": [["Input", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "name": "Input", "sparse": false, "batch_input_shape": [null, 236, 348, 3]}, "name": "Input", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "name": "conv0", "bias_constraint": null, "strides": [2, 2], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "use_bias": true, "bias_regularizer": null, "filters": 16}, "name": "conv0", "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn0", "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99}, "name": "bn0", "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "a0", "trainable": true}, "name": "a0", "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pool0", "strides": [2, 2]}, "name": "max_pool0", "inbound_nodes": [[["a0", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.4, "noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true}, "name": "dropout_1", "inbound_nodes": [[["max_pool0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "name": "conv1", "bias_constraint": null, "strides": [2, 2], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "use_bias": true, "bias_regularizer": null, "filters": 64}, "name": "conv1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn1", "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99}, "name": "bn1", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "a1", "trainable": true}, "name": "a1", "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pool1", "strides": [2, 2]}, "name": "max_pool1", "inbound_nodes": [[["a1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.4, "noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true}, "name": "dropout_2", "inbound_nodes": [[["max_pool1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "name": "conv2", "bias_constraint": null, "strides": [2, 2], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "use_bias": true, "bias_regularizer": null, "filters": 256}, "name": "conv2", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2", "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99}, "name": "bn2", "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "a2", "trainable": true}, "name": "a2", "inbound_nodes": [[["bn2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pool2", "strides": [2, 2]}, "name": "max_pool2", "inbound_nodes": [[["a2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "name": "dropout_3", "seed": null, "trainable": true}, "name": "dropout_3", "inbound_nodes": [[["max_pool2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "name": "conv3", "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "use_bias": true, "bias_regularizer": null, "filters": 1024}, "name": "conv3", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3", "epsilon": 0.001, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99}, "name": "bn3", "inbound_nodes": [[["conv3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "a3", "trainable": true}, "name": "a3", "inbound_nodes": [[["bn3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [1, 1], "name": "max_pool3", "strides": [1, 1]}, "name": "max_pool3", "inbound_nodes": [[["a3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "name": "dropout_4", "seed": null, "trainable": true}, "name": "dropout_4", "inbound_nodes": [[["max_pool3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "name": "flatten_1", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "fc0", "units": 30, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "relu", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null}, "name": "fc0", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "name": "dropout_5", "seed": null, "trainable": true}, "name": "dropout_5", "inbound_nodes": [[["fc0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "fc1", "units": 30, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "relu", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null}, "name": "fc1", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "sigmoid", "units": 1, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "sigmoid", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null}, "name": "sigmoid", "inbound_nodes": [[["fc1", 0, 0, {}]]]}], "output_layers": [["sigmoid", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.3"}