{"class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["sigmoid", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 236, 348, 3], "sparse": false, "name": "Input"}, "name": "Input"}, {"inbound_nodes": [[["Input", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 32, "trainable": true, "padding": "valid", "kernel_constraint": null, "strides": [4, 4], "name": "conv0", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [7, 7], "activity_regularizer": null, "data_format": "channels_last", "activation": "linear"}, "name": "conv0"}, {"inbound_nodes": [[["conv0", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null, "name": "bn0", "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn0"}, {"inbound_nodes": [[["bn0", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "a0"}, "name": "a0"}, {"inbound_nodes": [[["a0", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pool0", "strides": [2, 2], "trainable": true}, "name": "max_pool0"}, {"inbound_nodes": [[["max_pool0", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.4, "seed": null, "trainable": true, "name": "dropout_41"}, "name": "dropout_41"}, {"inbound_nodes": [[["dropout_41", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 128, "trainable": true, "padding": "valid", "kernel_constraint": null, "strides": [3, 3], "name": "conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "activity_regularizer": null, "data_format": "channels_last", "activation": "linear"}, "name": "conv1"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null, "name": "bn1", "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn1"}, {"inbound_nodes": [[["bn1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "a1"}, "name": "a1"}, {"inbound_nodes": [[["a1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pool1", "strides": [2, 2], "trainable": true}, "name": "max_pool1"}, {"inbound_nodes": [[["max_pool1", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.4, "seed": null, "trainable": true, "name": "dropout_42"}, "name": "dropout_42"}, {"inbound_nodes": [[["dropout_42", 0, 0, {}]]], "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 256, "trainable": true, "padding": "valid", "kernel_constraint": null, "strides": [1, 1], "name": "conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "activation": "linear"}, "name": "conv2"}, {"inbound_nodes": [[["conv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null, "name": "bn2", "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn2"}, {"inbound_nodes": [[["bn2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "a2"}, "name": "a2"}, {"inbound_nodes": [[["a2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [1, 1], "padding": "valid", "data_format": "channels_last", "name": "max_pool2", "strides": [1, 1], "trainable": true}, "name": "max_pool2"}, {"inbound_nodes": [[["max_pool2", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "seed": null, "trainable": true, "name": "dropout_43"}, "name": "dropout_43"}, {"inbound_nodes": [[["dropout_43", 0, 0, {}]]], "class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_7"}, "name": "flatten_7"}, {"inbound_nodes": [[["flatten_7", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "activation": "relu", "name": "fc0", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "units": 20}, "name": "fc0"}, {"inbound_nodes": [[["fc0", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "seed": null, "trainable": true, "name": "dropout_44"}, "name": "dropout_44"}, {"inbound_nodes": [[["dropout_44", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "activation": "relu", "name": "fc1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "units": 10}, "name": "fc1"}, {"inbound_nodes": [[["fc1", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "activation": "sigmoid", "name": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "units": 1}, "name": "sigmoid"}], "input_layers": [["Input", 0, 0]], "name": "model_7"}, "keras_version": "2.2.3"}